---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadCombination.IsThirdPartyGenerated
source: html/d0c2a39d-eae8-2807-b6df-251baab5505c.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.IsThirdPartyGenerated Property

Indicates if the load combination was created by API.

## Syntax (C#)
```csharp
public bool IsThirdPartyGenerated { get; }
```